JuanenRac/HYDRA-UMC/firmware/mcu_stm32g474/STM32G474RE_main.c
/*
 * =============================================================================
 * STM32G474RE_main.c - Robot Controller Board application entry point
 * PROJECT: HYDRA-UMC (Robot Controller Board firmware, Tier 1 - STM32G474RET6)
 * AUTHOR: JuanenRac (Electro Hobby 3D) - electrohobby3d@gmail.com
 * LICENSE: GPL-3.0 - see repo root LICENSE
 *
 * STARTING POINT ONLY - proves the toolchain/HAL/linker/FreeRTOS setup
 * documented in docs/COMPILE_STM32G474.TXT actually produces a working
 * binary (a single FreeRTOS task toggling a GPIO, the traditional "does
 * this chip even boot, and does the scheduler actually run" smoke test),
 * not a real robot-controller-board application yet. Real work still
 * needed here, tracked against HYDRA-UMC/docs/architecture.md:
 *   - Real tasks: FDCAN Tier 1 protocol handling, 6-axis STEP/DIR/EN pulse
 *     generation, endstop polling - vBlinkTask below is a placeholder for
 *     where those tasks (plural - this is why a real scheduler is used
 *     instead of a superloop) will live, not itself one of them
 *   - FDCAN1 init + the Tier 1 slot-addressed protocol (architecture.md §3)
 *   - FDCAN2 (or 3) init + the Tier 2/3 relay tunnel (architecture.md §4)
 *   - Real clock tree config (left at HSI 16 MHz default below - fine for
 *     this smoke test, NOT fine for real FDCAN bit timing or step-pulse
 *     precision) - FreeRTOSConfig.h's own configCPU_CLOCK_HZ must be
 *     updated in the SAME commit as whichever change fixes this, or every
 *     FreeRTOS tick/delay silently goes wrong
 *   - The bootloader-facing side of the metadata/main/backup flash split
 *     defined in STM32G474RETx_APP.ld's own header comment
 *
 * PIN: PC13, STATUS_LED - a REAL pinout allocation now, not a Nucleo-dev-
 * board placeholder (see docs/PINOUT_STM32G474_ROBOT_CONTROLLER.TXT
 * section 4). The chip's other real peripherals (FDCAN1/2, 6x TMC5160A
 * SPI daisy-chain + STEP/DIR/EN, 6x endstops, SLOT_ID straps) are all
 * pinned out in that same file but NOT yet initialized here - that's the
 * "real tasks" work listed below, still not done. The bootloader
 * (../boot/) DOES already initialize FDCAN1 for real - see that folder's
 * own bootloader_main.c if you need a working reference for this file's
 * own eventual FDCAN1 init.
 *
 * FreeRTOS note: SVC_Handler/PendSV_Handler/SysTick_Handler are deliberately
 * NOT defined in this file - FreeRTOSConfig.h renames FreeRTOS's own port.c
 * handlers onto those exact symbol names instead (see that file's own
 * header comment). Defining them here too would be a duplicate-symbol link
 * error.
 * =============================================================================
 */

#include "FreeRTOS.h"
#include "task.h"
#include "stm32g4xx_hal.h"

static void Error_Handler(void)
{
  __disable_irq();
  while (1) { }
}

static void GPIO_Init(void)
{
  __HAL_RCC_GPIOC_CLK_ENABLE();

  GPIO_InitTypeDef gpio = {0};
  gpio.Pin = GPIO_PIN_13;
  gpio.Mode = GPIO_MODE_OUTPUT_PP;
  gpio.Pull = GPIO_NOPULL;
  gpio.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOC, &gpio);
}

static void vBlinkTask(void *pvParameters)
{
  (void)pvParameters;
  for (;;) {
    HAL_GPIO_TogglePin(GPIOC, GPIO_PIN_13);
    vTaskDelay(pdMS_TO_TICKS(500));
  }
}

int main(void)
{
  HAL_StatusTypeDef hal_status = HAL_Init();
  if (hal_status != HAL_OK) {
    Error_Handler();
  }

  /* Clock tree left at HSI (16 MHz) reset default - a smoke-test-only
   * choice. Real FDCAN bit timing and step-pulse generation both need a
   * proper SystemClock_Config() (HSE + PLL) written once the board's real
   * crystal/oscillator choice is known - see this file's own header, and
   * update FreeRTOSConfig.h's own configCPU_CLOCK_HZ in the same commit. */

  GPIO_Init();

  xTaskCreate(vBlinkTask, "blink", configMINIMAL_STACK_SIZE, NULL, tskIDLE_PRIORITY + 1, NULL);

  vTaskStartScheduler();

  /* Only reached if vTaskStartScheduler() itself failed (e.g. out of heap
   * for the idle/timer tasks) - not a normal code path. */
  Error_Handler();
  for (;;) { }
}

void vApplicationStackOverflowHook(TaskHandle_t xTask, char *pcTaskName)
{
  (void)xTask; (void)pcTaskName;
  __disable_irq();
  while (1) { }
}

void vApplicationMallocFailedHook(void)
{
  __disable_irq();
  while (1) { }
}

/* FreeRTOS now owns SysTick (see this file's own header comment on the
 * handler rename in FreeRTOSConfig.h) - HAL_IncTick() has to be driven from
 * somewhere else, or HAL_GetTick()/HAL_Delay() silently stop advancing.
 * configUSE_TICK_HOOK=1 in FreeRTOSConfig.h calls this once per tick. */
void vApplicationTickHook(void)
{
  HAL_IncTick();
}

void HAL_MspInit(void)
{
  __HAL_RCC_SYSCFG_CLK_ENABLE();
  __HAL_RCC_PWR_CLK_ENABLE();
}

void NMI_Handler(void) { }
void HardFault_Handler(void) { while (1) { } }
void MemManage_Handler(void) { while (1) { } }
void BusFault_Handler(void) { while (1) { } }
void UsageFault_Handler(void) { while (1) { } }
